src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиСинхронизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериодНачалоПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериодОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьСправочники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соединение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МС_НастройкиПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НастройкаЗагрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МС_ЗапросыКВнешнимИсточникам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиСинхронизации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

// Параметры обработчика ожидания задани обмена
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

// Форма длительных операций
&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриЧтенииСозданииНаСервере();
	
	Элементы.ГруппаПериодДаты.Видимость = Не Объект.ВычисляемыйПериод;
	Элементы.ГруппаПериодВычисляемый.Видимость = Объект.ВычисляемыйПериод;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьНадписьРасписанияОбмена();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере(ТекущийОбъект);
КонецПроцедуры
 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Справочники.МС_НастройкиСинхронизации.НайтиПоНаименованию(ТекущийОбъект.Наименование, Истина)) 
		И Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Уже существует настройка синхронизации с таким именем, 
		|сохранение невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли; 
	
	Если Не ТекущийОбъект.Код = "" Тогда
		
		Задание = ТекущийОбъект.ПолучитьРегламентноеЗадание();
		
		Если Задание = Неопределено Тогда
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("ЗапускДополнительныхОбработок");
			Задание.Использование = Истина;
			Задание.Ключ = Строка(Новый УникальныйИдентификатор);
			ТекущийОбъект.ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
		КонецЕсли; 
		
		Задание.Наименование = "(МС) " + ТекущийОбъект.Наименование;
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ТекущийОбъект.Ссылка);
		ПараметрыЗадания.Добавить("МС_СинхронизацияСервер.ЗаданиеСинхронизацияДанных("""+ ТекущийОбъект.Код +""")");
		Задание.Параметры = ПараметрыЗадания;
		Задание.Расписание = РасписаниеРегламентногоЗадания;
		Задание.Записать();
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Код настройки не записан в регламентном задании");
		
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере(ТекущийОбъект = Неопределено)
	
	Если Не ТекущийОбъект = Неопределено Тогда
	
		УстановитьРасписаниеРегламентногоЗаданияПриЧтенииНаСервере(ТекущийОбъект);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьРасписанияОбмена()

	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		ТекстЗаголовка = "Настроить расписание обмена";
	Иначе
		ТекстЗаголовка = РасписаниеРегламентногоЗадания;
	КонецЕсли;

	Элементы.НастроитьРасписаниеОбмена.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРасписаниеРегламентногоЗаданияПриЧтенииНаСервере(ТекущийОбъект)

	Задание = ТекущийОбъект.ПолучитьРегламентноеЗадание();
	
	Если Не Задание = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Задание.Расписание;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура НастройкиЗагрузкиПолноеИмяФормыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("ИменаФорм", Элементы.НастройкиЗагрузки.ТекущиеДанные.ПолноеИмяФормы);
	
	Оповещение = Новый ОписаниеОповещения("РедактироватьПолноеИмяФормыЗавершение", ЭтотОбъект, 
		Новый Структура("Идентификатор", Элементы.НастройкиЗагрузки.ТекущиеДанные.ПолучитьИдентификатор()));
	
	ОткрытьФорму("Справочник.МС_НастройкиСинхронизации.Форма.ФормаВводаИменФорм", ПараметрыОткрытия, 
		ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПолноеИмяФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	УстановитьСтрокуИменФорм(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтрокуИменФорм(Результат, ДополнительныеПараметры)
	
	Если ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
	
		СтрокаНастройки = Объект.НастройкиЗагрузки.НайтиПоИдентификатору(ДополнительныеПараметры.Идентификатор);
		
		ПолноеИмяФормы = "";
		
		Для Каждого Стр Из Результат Цикл
			
			ПолноеИмяФормы = ПолноеИмяФормы + ?(ПолноеИмяФормы = "", "", "|") + Стр.Значение;
			
		КонецЦикла;
		
		СтрокаНастройки.ПолноеИмяФормы = ПолноеИмяФормы;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
				
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗадания",
					ПараметрыОбработчикаОжидания.ТекущийИнтервал,
					Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		
		СообщенияПользователю = СообщенияФоновогоЗадания(ИдентификаторЗадания);
		Если СообщенияПользователю <> Неопределено Тогда
			Для каждого СообщениеФоновогоЗадания Из СообщенияПользователю Цикл
				СообщениеФоновогоЗадания.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СообщенияФоновогоЗадания(ИдентификаторЗадания)
	
	СообщенияПользователю = Новый Массив;
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		СообщенияПользователю = ФоновоеЗадание.ПолучитьСообщенияПользователю();
	КонецЕсли;
	
	Возврат СообщенияПользователю;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед выполнением обмена необходимо сохранить настройки");
		Возврат;
	КонецЕсли; 
	
	Результат = ОбработкаКомандыВДлительнойОперации();
	
	Если Не Результат.ЗаданиеВыполнено = Истина Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища		 = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ИдентификаторЗадания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура ВычислитьПериод(Команда)
	
	ВычислитьПериодНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьПериодНаСервере()
	
	Попытка
		СтрокаВычисления = "ВычисляемыйПериодНачалоПериодаРезультат = " + Объект.ВычисляемыйПериодНачалоПериода;
		Выполнить(СтрокаВычисления);
		
		ПараметрыВычисления = Новый Структура;
		ПараметрыВычисления.Вставить("Результат", ВычисляемыйПериодНачалоПериодаРезультат);
		СтрокаВычисления = "Параметры.Результат = " + Объект.ВычисляемыйПериодНачалоПериода;
		ОбщегоНазначения.ВыполнитьВБезопасномРежиме(СтрокаВычисления, ПараметрыВычисления);
		ВычисляемыйПериодНачалоПериодаРезультат = ПараметрыВычисления.Результат;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
	Попытка
		СтрокаВычисления = "ВычисляемыйПериодОкончаниеПериодаРезультат = " + Объект.ВычисляемыйПериодОкончаниеПериода;
		Выполнить(СтрокаВычисления);
		
		ПараметрыВычисления = Новый Структура;
		ПараметрыВычисления.Вставить("Результат", ВычисляемыйПериодОкончаниеПериодаРезультат);
		СтрокаВычисления = "Параметры.Результат = " + Объект.ВычисляемыйПериодОкончаниеПериода;
		ОбщегоНазначения.ВыполнитьВБезопасномРежиме(СтрокаВычисления, ПараметрыВычисления);
		ВычисляемыйПериодОкончаниеПериодаРезультат = ПараметрыВычисления.Результат;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеОбмена(Команда)
	
	ВыполнитьНастройкуРасписанияОбмена();
	УстановитьНадписьРасписанияОбмена();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияОбмена()

	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли; 
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменятьРасписание", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменятьРасписание(РасписаниеЗадания, ДополнительныеПараметры) Экспорт

	Если РасписаниеЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	РасписаниеРегламентногоЗадания = РасписаниеЗадания;
	
	УстановитьНадписьРасписанияОбмена();

КонецПроцедуры
 
&НаСервере
Функция ОбработкаКомандыВДлительнойОперации()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НастройкаСинхронизации", Объект.Ссылка);
	
	НаименованиеЗадания = НСтр("ru = 'Выполнение синхронизации данных';
								|en = 'Data synchronization'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"МС_СинхронизацияСервер.ОбработкаКомандыСинхронизации",
		СтруктураПараметров,
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Возврат Результат;
	
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВычисляемыйПериод1ПриИзменении(Элемент)
	
	Элементы.ГруппаПериодДаты.Видимость = Не Объект.ВычисляемыйПериод;
	Элементы.ГруппаПериодВычисляемый.Видимость = Объект.ВычисляемыйПериод;
	
	
КонецПроцедуры

#КонецОбласти
